package com.bjtuhbxy.hb.dao;

import com.bjtuhbxy.hb.HbApplication;
import com.bjtuhbxy.hb.pojo.Student;
import org.junit.Test;
import org.junit.runner.RunWith;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;
import org.springframework.test.context.junit4.SpringRunner;

@RunWith(SpringRunner.class)
@SpringBootTest(classes = HbApplication.class)// 就是你springboot的启动类
public class StudentDAOTest {


    @Autowired
    StudentDAO studentDAO;

    @Test
    public void StudentTest(){
        String namesm="富兴怀冷承恩袁兴言屠星渊谭英发巴弘义郝信鸥公高澹杜成弘相弘光邰和通李修伟乜建柏司良弼卓鸿光索明俊芮烨烁谷翰池厍明志益经业厉高澹马和正武俊哲宓安宜庾俊德惠荣轩黄宏远唐宇航敖华池鄂宇荫罗鸿振茹修德蒲宏盛冀煜祺钭温茂芮高远糜浩浩隗鹤轩武烨伟弓和怡利乐章杜永言谭嘉树苍正浩牧正文唐坚白黄开济郁飞星厉建中刘宏扬梁学民史玉书益逸春于浩初龙成天龙俊逸方经业钭弘亮屠力夫赵雨泽糜雅珺谭俊贤蒙彭薄后敏达饶俊良秦建本殳英卫容英纵空雪峰相浩荡松承平吴温瑜贡高原慕德业饶永长阙泰华符宏放文高杰康浩波毋玉宸胡和歌宰俊风巢和韵曹承天阙和硕贺志诚庾涵蓄蓟承教武涵畅车鹏运吴修能沈波鸿相开诚毋勇军弓鸿光富俊能梁良才蔚天和郝建柏濮开畅终鹏运从熠彤詹元勋杨高邈贾和歌钟良策充博达林和裕辛俊良寇高岑许阳旭印兴昌富茂才黄思远孟阳成辛弘亮辛弘懿鱼雪风孟学义邴睿诚蔚元正邵德运聂和豫宿元青牧嘉年常光赫郜雪风申康裕暴鸿畅辛安晏璩振海钟和顺蒋鹏池逯冠玉束庆生景蕴和家兴昌焦飞鹏冀宏邈权子平阎元驹欧鸿禧冯景焕养俊良田建中后鸿祯游修然耿俊发贡嘉勋翟乐水车天禄孙乐容黎成益宁飞扬郏鸿宝能弘厚咸煜祺宋修雅熊文虹晃和韵王勇毅堵哲彦隗俊捷勾昊昊后明喆韩德佑唐俊语董和悦许良吉蒲翰翮巴朋义弘鸿晖怀乐湛从才哲顾和风毛煜祺戴泰初钱正豪羿茂典连英喆文弘义高正豪阚明达毛乐心怀光临白明轩邱和顺郏高飞祖立果漕俊德融建树浦玉宇桂思博逯俊贤谭睿聪璩昊苍孙宜人邓华辉焦黎昕储锐思郝朋兴丁光辉广光亮充修明汲明亮阎绍钧牛荣轩蓟阳冰贡力学尚温纶家修文濮俊美符学名师宇寰钟信鸥禄嘉树夏庆生沃靖琪敖奇伟熊宏博向星文敖俊明扈玉泽张绍辉宦坚秉杨鸿宝古雨信闻鸿熙逢承福翟良才束阳焱谢鸿羲阎飞宇仰志新崔乐家敖泰鸿邱飞雨雍飞羽习冠宇饶嘉澍宋建茗郗子默殳力行邓德寿苏成天乜安歌惠嘉慕毛欣怡终博裕那德明邵风华堵志国符宇寰郝锐智扈康胜曾璞瑜浦俊弼司蕴涵贾正卿郏景辉郜文虹景学名白宜然后兴学萧和风关良平夏宏硕贡建华宁茂典从康平聂俊健晃修雅阙彭越充德曜那同济蒯经艺利立辉白博涛邓鸿羽向鸿熙宰永言越天路易光临家理群牛乐康甘自明秦巍奕从正志余敏达龙鹏飞侯自怡阴嘉平简思聪廖鸿朗邹咏德浦雅达公天韵索康胜向弘方卢俊弼毋兴朝越涵衍史正信韩德业苏浩渺谭德元郑翰采曾修贤唐永新宦俊风双智明罗华灿龚高韵贺涵煦劳和悦夏展鹏冀鸿风麴新知黄阳冰瞿祺福漕子濯满鹏程班高杰邰成弘蓬鸿晖靳永寿郑鸿波濮刚豪郗乐意公思博文修文杨良材隗同济容修文甄德义叶明杰郗宏富宫才哲璩俊发邹阳平通鸿宝萧嘉荣养志用陆自珍张鸿宝毋安晏宁鸿志段飞跃蒯锐意松光济蔚振国罗宏大吕弘济惠英纵余哲瀚后烨烁冷勇毅能天骄赵鸿祯贡毅然漕蕴藉弓伟祺訾天路庄康宁王高岑空星晖隗晓博麴哲圣武康裕朱坚白农正卿雍志义相晋鹏居翰音蓟永嘉钱成业国兴业蒙弘方厍德明翟明珠顾正雅蓟文耀逢俊喆籍星宇璩嘉志宓浩涆连和悦黄向阳桂文彦巢弘方咸星雨高光熙卢意致熊逸春乌俊侠林安平权乐湛慎伟晔戴华荣乔华翰唐永丰杨阳羽习嘉木庾斯年阙高峰庾玉宇籍泰河谢飞英漕高扬那浩歌薛博涉唐雨信焦俊晤牛俊力靳凯安师涵意司向阳公项禹陆同和沃承弼尹乐正段璞玉温光济申嘉瑞曾敏叡田鸿畴邓自珍韶天工慎光明阴伟晔冀博容殳咏歌寇宾鸿袁嘉运耿永逸苏正信通温瑜益翰海贾元恺乜乐圣厉弘光傅璞玉逯嘉懿温天瑞相文敏松和韵糜嘉熙郑锐志隆高朗松英朗牧康顺贺思远常华辉郑雨星訾建白辛雨泽邹奇迈汲兴学袁文德邴德海富宇达古泽宇廖志专姚阳嘉崔信然浦雨石谢茂学龙凯安庄宇文詹玉成蒋烨伟苏康盛景元纬钭信厚顾和顺束锐阵黎咏志钭宏伯逢弘义郏华藏通建华徐景山须嘉颖古嘉年连光耀石向荣耿和洽禄飞翮史博赡靳和蔼高德宇容俊誉须景天权嘉实宰阳华牛博赡暴兴运双哲茂秦智鑫钭雪风阴欣可璩同方鄂振国胡国源蓬安顺厍弘盛雍熠彤叶英哲融鸿云阚涵蓄晃茂学车建明沈俊发潘自珍菱和雅尚飞扬养高义弓鸿畅堵建德邹滨海国朋兴阙意远张嘉致徐鹏鹍简志文卓永嘉谢宜年史文德后雅逸衡波涛欧和泰权嘉许金茂学从锐智武俊才王高谊李才良麴敏叡桂天成韩飞鹏武修雅郁彭祖桂嘉玉韶文翰劳德华边明远芮俊友吴同光寇才良红波光武雅逸晏坚白燕文敏寇信厚卢力夫翟奇迈詹荣轩郗星海谢兴为熊和同孙弘懿丁祺瑞邱康成漕和裕刘德寿简志专崔安澜公元洲慕子平宰乐心晃鸿文薛雨泽冀凯安姜天宇林奇迈常承业李涵涤郗良工谢乐人邵志义徐升荣易宏深聂修真万嘉赐通鸿彩翟阳波宿俊远蓬弘扬江子明阙涵忍卢博达容子瑜利德义牧建修逯宜修熊安翔赖飞章养良骏璩弘光简和平韶开宇石景焕姚明智巢弘懿郁锐意陈阳冰蔡玉韵堵风华何阳德丁鸿晖史和正吴俊风广文彦谢良俊糜向文屠茂彦慕靖琪公宏壮蒋晗昱祖康平麴星波汪修文崔立果于弘新巢文石束兴庆菱奇志关涵涤红奇略乔阳嘉乔泽语戴文彬孔晋鹏隗博实侯安顺公永春贾俊晤叶俊捷瞿元忠伊德容顾雪松甄鸿畅丁乐天戈坚秉仰项禹邓乐欣宓奇逸冷星辰陆嘉实于弘方党涵意杨文德阎峻熙逯伟才相元纬于勇男逯志专苍俊爽易成礼糜修文雍鸿信吴宏富扈雅逸钭浩渺万俊健钱乐圣赵飞驰利文德傅嘉瑞暨天干任坚白沈新立彭成天郜高谊刘锐翰蒲嘉庆仰嘉许闻修贤麴英范巢良俊阙曾琪萧智鑫祖弘深盖自明訾乐天充俊材庄蕴和姚凯复康翔宇胡和玉堵和裕广鸿卓阚明珠蓟欣悦李朋义池俊风陈弘新双阳华须高芬董自珍屠思远苍嘉勋陆鹏翼冷英勋汪玉堂崔新知储鹏翼终元甲彭阳云屠康健梁鸿福寇苑博蒲博裕巴涵映冯和风寇博裕燕宏毅崔鸿福耿明知屠英光简高峰郁俊杰融力强莘奇正司宏胜富和歌杜欣嘉权乐游蓟毅然汤承业庾兴业那乐家辛星华茹立轩乔天元苏刚毅文和风钟璞瑜籍英飙惠志文吕立群田志强利正浩暴宏邈养建德司成礼利高朗庾高飞融奇玮党智志朱承允阴意远江同济宰奇正储立群冀康裕鱼元洲终高芬文阳伯聂浩渺终鸿信阙弘和田刚捷姜子轩莘飞尘能成礼蔡承平甄锦程终嘉勋宦弘和龙阳平熊同济邱泰清钭濮存璩阳秋程承允牧景辉任远航詹伟祺曹玉韵咸坚白通经艺赵康宁康元忠梁鸿风董飞白杜和昶姜翰学养良材乌智明孙明俊申睿博那安康古昊穹蓟子真宦宏旷能光华贺乐童汪良骥逯元明";
        String namesw="劳芮优堵小霞夏访彤束听然鄂凡旋咸雁枫林叶飞慕从阳孔语儿顾叶农终优悠祖思怡濮筠心班芮丽农芝蓉许束芳居立婷贡玲珑靳映秋毋绮琴逢格格曾曲文熊天音空白薇郗又儿翟小莉戴如凡邰心慈贡秋珊吴长丽司古香韩暄美鱼含莲周婷美金子怀侯平松广青筠富桃雨蒯卓然龚欣彤家雅安刘依玉郁瑞芝邱悦帆郜千凝池梵听吴绮艳芮小珍乜海儿贾瑜敏空智敏丁春雁蔚觅海古翠琴王余馥宦一璇相半凡车平晓贺夏旋利梓美宿冰凡于灵槐容舒扬崔芮婷阚饮月勾景文蔡娟娣甄丹南弘欣跃毋舒方范丽美沈学英班梅青邴淑颖劳锐洁菱瑞绣仰笑阳茹灵薇徐世英文佳悦公晨辰朱密思益晓枫国怜菡白痴梦马任真惠梓露景雪娟邓哲美燕平良万凝思国弘懿甘若英连锦洁双念之蒙苏微金蕙若牛菲菲师天睿富平松袁如心郏醉薇慎孟乐终妙海弘梦曼翟清霁敖悠素余又儿向萧曼益皎月咸晗玥寿娅玟林奕叶宰宝琳相嫣钰钭桐华空琇晶耿紊文甘秀妮怀夏雪龚珺琦韶思雁贡凝芙扶慧瑶国则悦隆清茹怀子萱养绿柳殳爱琴武千雁邹润洁史恨云秦香卉段梦松贺海云须依风甄安荷漕晓露勾景文茹采绿孟雅蕊车美玲牛思莲董音悦扶晓灵籍贞静芮静槐冉格菲冉盼柳阙靖柔弓翠梅温裕梅宰萦心丁映寒田瑞锦陆思洁那山灵燕晨风詹梦凡景雅绿温冰凡夏钰彤甘欣愉林泽瑛庄雅美郝芷兰高白莲饶碧春乔辰伶红朝雨秦迎蕾印亚玲幸琬莹贺茹薇扈紫槐满璇子易舒兰羿彦芝蓬沛芹汪莞然卓念薇曾莉颖龙冷瞳习芷文蒯琳溪衡丝雨慕清舒冉义茹巢国英厍清馨钟生文茹恨竹禄梓颖彭梓婷惠莹琇黄偲偲邵朵儿江经文蒙芳馥暴溪儿殳林娜师柳思江靖雁家明熙芮芊丽印春绿暨彩静储翠玉邴夏初叶泽芳卢典丽廖怡然容宇芳蒙巧风晏愉心唐觅风益香菱甄藤井郜柔惠毛瑶华索翠玉怀平松屠饮香蔡兰矢弘寻琴戈晴照桂冬卉景怜南阚蔓菁暨运菱衡新之阎洛凝那苏微幸隽巧乌哲妍詹菁英容子帆敖秋春田米莱双书蕾利瑞芬那暄妍袁素华申水芸赵君雅詹灵薇咸薇颖慎琳竣姚木兰罗瑾萱翟傲云邓雅云盖伊颜牛多思赵锦文罗怡悦阎凌寒苏小妍麴钰彤郏智宸雍胜红庄茜茜通育梅靳平松终紫颖郭秀芳逯国娟卓帮琼简顺美敖庄雅勾之瑶蓟忆安戈可心籍竹萱汪慧秀甘幼蓉农心远弘代双石梅梅连玮琪郏念波邴白筠萧菊华屠辰伶桂春芳祖初柳茹旭辉游长丽杨若南勾凡梦潘清韵宓莘莘惠美偲满秋芸蒲子薇向胜花徐恬悦郝琬莹耿婷旭许和豫史雨晴简菱华于采绿熊苏弥丁曦秀逯初蝶班月灵萧飞荷薛晗雨秦千凝终欢悦潘千城巴天恩翟水舞张慕夕殳盼山富慕夕幸幼丝寇梓馨印爰爰牛语芙屠乐欣张琇芳贺彩燕蓬南晴熊又菡公柯洁景嘉玉红木蓉宰悦喜范隅晖朱悦媛相妙思盖平春李楼兰沃胜花田韶仪咸琴轩桂清晖郜初翠国柔静钭天心阴柔煦郝海儿牧雅霜郭紫丝武柳瑾姜韫玉勾沈靖邰芸莹杜巧春厍柳瑾劳辰雪隆婧玟祖子薇苏山雁汲天音边寒蕾蒲言心乌欣欣盖国琴侯一凡公紫青韩新颖麴琰琬黎绮琴能悠婉乔雨琴崔曼柔姜元霜怀春妤乔添智吴凌香边秋华沈滢莹汤悦心王善玲廖歌玲沈欣瑶符颖然殳悠雅勾慧瑶罗友容能锦婷姚兰七潘紫丝厍梦香王玄雅郁小霞汲于娜利胤雅越寒雁甘会雯双司晨田忆香胡蔡琳巴雅唱习北晶许宜春戴秀妮羿梓莹曹塔娜黎微澜白言文莘兰若晏书兰黄小凝田桃尐宋雪枫黎以旋袁燕星万芳林傅望慕简俨雅池忆之从瓶花宓婉怡厉孤晴汤琼华魏娟丽毛代芙厍书桃巢星瑶贡友桃钭巧娜连俊英钭双文勾丝娜敖平良富梓瑶阎可儿郏燕婉芮忆梅简静丹家麦冬万斯玉居绮丽宁家欣庄清馨文夜午张绮云邰锦凡松展文邴谷蕊姜国政那蔚然居天慧游白薇游晓蓝融雪翎毋雅丽贾宜然储晴画蒯凌雪萧映天屠塔娜莘怀思叶紫文田白筠闻淑贤逯知睿束安蕾庾子美温琳爰寿君茹金冰海扶姝惠苏若彤孟恨竹宁新烟饶柔淑邹泽芳相晓燕姜朝旭汲靖巧蒙悠奕吕晗晗廖皎洁程半梦马冰烟罗虹玉逯巧玲黄晶瑶毛山芙秦流逸郝天悦刘花泽屠宛曼余雯华钱步美蒲蓓蕾农雅凡崔雁易吕曼安麴冠芳广琛丽冯闵雨乌雪娟阴夏寒欧逸美满心香梁迎荷暨寄灵隗寄真程天籁廖冰兰蒲洁莹宓芮欢顾杨柳宋芊丽燕平和戌哲妍谭琪华姜丹烟惠痴梅王松月乔茉莉隗晶茹龚秀妮须觅风麴齐心何彦杉印端丽陆光文韩语晨融傲晴熊凝竹曾从云充滇萍阚涵涵盖灵雨公飞瑶宓春雁慕沛蓝尚冬卉邱平婉乌卓然羿晨旭扶曼卉石幻翠咸谷波乌于娜蔡初然罗春晓易莹琇秦乐悦郝以蕊余畅然宿月桃顾龙梅勾翠霜阚安妮毋听白万苏幻温芳苓菱梦寒沈如曼从燕平籍雨南糜桃尐相薏冉庾从露邴智敏訾西柠申罗绮禄敏慧燕湛娟终楚洁闻梦茹毋寻真能梦竹康庄静沃半烟瞿铃语康采薇慎尔丝牛翠柔怀凝蕊江姝妍利晨风燕尔云杨凝然通雨南劳惜儿吴丽姝巢慧婕曾飞兰桂木蓉鱼蔡琳邹怡婷夏晗蕾朱依婷卓安卉暴炜琳蒙馨香吕悦驰蒙卓逸蓟美丽菱知慧国代萱聂舒云翟婵娟史雪蓉翟春枫邴贝莉孔以蓝沃茹薇糜微熹丁安卉谷虹影江蔓蔓松秋柳钱凌翠弘西贝马源源濮怡金文慕夕养饮香幸安卉王秀如冷瑜莉邱琼芳胡尔槐金紊文暨三诗潘洮洮隗歌云高永琴暴书语权睿文靳瑛蔓越和怡熊千青能嘉淑秦秋月魏妙婧景诗桃暴有芳丁凝阳扈璇珠郝竹筱靳含香宫欣可马姝好隆卿云彭奥婷印芝英宰红丽苍希月利微婉蒋悦婷钭欣玉尹天晴戴闵雨龚夏菡梁俊雅阎娅欣余韵磬蒯兰尹傅依秋那云水宰紫蓝曾春雁游子爱申南珍曹郁安阙刖颖申梓倩徐冰枫乜孤晴宫星菱王以欣扈迎海秦紫菱饶虹雨那吉敏逯静枫白雅韶孟思恩梁雅宁易绮艳弓柏颜禄白薇蒲雁易池谷冬阙隽巧景怡婷宦竹悦越翠玲乔云露万丽文崔依婷蒙灿灿董灵薇慕梓欣廖清润侯楚冉殳熙柔谢慧瑶卓司晨段珊珊符云飞班孟乐祖楚洁崔飞烟夏小宸须微月丁淑然尚子美阚天晴庄妙音幸梵听关秀艳庾蕴和冉芳蕙国谷蕊鱼嘉淑谭梦之胡问雁空颖然杜月华曾冰彦范希慕戴友菱党妙珍靳梦蕾党夏旋毋盼曼聂含海融歌韵宋紫夏怀恬欣宓霓云白午瑶扶琳瑜边曼易翟南霜古怡悦马婉静邴巧娜劳欣嘉訾慧晨牧新美景语芙牛颖颖符嫔然史卷玉伊雅辰沃陶然苏芷卉寇紫蓝相令慧边曼珠戈燕平公平良苏怜菡彭问儿屠乐悦谢安青仰乐心孔梓洁车芷卉权瑞芬慎蔚然巢昕雨邓寄春蔚恨之汪小溪关春英苏姗婷利晨希咸瑞锦扈雁凡韩欣跃寿哲思冯乐然邴洛妃钭书艺祖如意宋卿云庾音悦邴冬亦王灵仙易冰之巴易巧廖虹星鱼优乐蒲冰冰何绪婷石燕齐韶晴美束恩霈彭丝萝羿芸熙董逸丽索梅英党梓婧鱼半香桓念巧司霁芸";

        String name="";
        int flagm=0;
        int flagw=0;

        Student student = new Student();
        int buildid=1;
        for (int k =1 ;k<=8;k++) {
            int nj=15+(k+1)/2;
            nj*=10000;
            nj+=1111;
            for (int i = buildid; i <= 6; i++) {
                int roomid = i * 100 + 1;
                for (int j = roomid; j <= roomid + 5; j++) {

                    //宿舍成员添加
                    for (int l = 1; l <= 4; l++) {
                        student.setId(0);
                        student.setSno(nj++);
                        if (k%2==1){
                            name=namesm.substring(flagm,flagm+3);
                            flagm+=3;
                        }else{
                            name=namesw.substring(flagw,flagw+3);
                            flagw+=3;
                        }
                        student.setName(name);
                        student.setRoomId(j);
                        student.setBuildingId(k);
                        studentDAO.save(student);
                    }
                }
            }
        }
    }
}
